# Програма має виконувати прості математичні дії (+, -, *, /).
# Користувачеві пропонується почерзі ввести числа та дію над цими числами,
# а програма, виходячи з дії, обчислює та друкує результат.
# Зробити перевірку на те, що при діленні дільник не дорівнює 0!

a = int(input("Введите число A: "))
b = int(input("Введите число B: "))
c = input("Введите символ (+, -, *, /): ")

if c == "+":
    print(a, "+", b, "=", a + b)

elif c == "-":
    print(a, "-", b, "=", a - b)

elif c == "*":
    print(a, "*", b, "=", a * b)

elif c == "/":
    if b == 0:
        print("Делитель не должен быть нулем!")
    else:
        print(a, "/", b, "=", a / b)