#Завдання складається з двох пунктів:
#Створіть список випадкових чисел із випадковою кількістю елементів від 3 до 10.
#Створить новий список в якому будуть 3 елементи зі списку з першого пункту - першим, третім і другим з кінця.
# Тобто у фінальному списку, перший елемент співпадає з першим елементом початкового списку.
# Другий елемент фінального списку - це третій елемент початкового. І третій елемент фінального - це другій елемент с кінця початкового списку.
#Приклад того, як може виглядати ітог - зліва можливий список з першого пункту, з права, те, що має бути в якості результату :
#[1, 2, 3, 4, 5, 6, 7, 9] => [1, 3, 7]

import random
my_list = []

for i in range(random.randint(3, 10)):
    my_list.append(random.randint(1, 100))

new_list = [my_list[0], my_list[2], my_list[-2]]
print(my_list, "=>", new_list)