# Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
# Тобто, в результаті повинен вийти список із 2-х списків.
# Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.
# Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
# Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
# у списку парна кількість елементів і в списку непарна кількість елементів.
# Приклади: Було => стало
# [1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
# [1, 2, 3] => [[1, 2], [3]]
# [1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
# [1] => [[1], []]
# [] => [[], []]

my_list = [1, 2, 3, 4, 5, 6]
# my_list = [1, 2, 3]
# my_list = [1, 2, 3, 4, 5]
# my_list = [1]
# my_list = []

if not my_list:
    new_list = [[], []]
else:
    mid_index = len(my_list) // 2
    if len(my_list) % 2 == 0:
        first_list = my_list[:mid_index]
        second_list = my_list[mid_index:]
    else:
        first_list = my_list[:mid_index + 1]
        second_list = my_list[mid_index + 1:]
    new_list = [first_list, second_list]

print(new_list)